## pd03. EDA(탐색적 데이터 분석)

In [2]:
import pandas as pd

df = pd.DataFrame({
    "메뉴": ['아메리카노', '카페라떼', '카페모카', '카푸치노', '에스프레소', '밀크티', '녹차'],
    "가격":[4500,5000,5500,5000,4000,5900,5300],
    "칼로리":[10,110,250,110,20,210,0]
})

df

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110
2   카페모카  5500  250
3   카푸치노  5000  110
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

### 1. 데이터프레임 샘플 확인

In [3]:
df.head(2)

      메뉴    가격  칼로리
0  아메리카노  4500   10
1   카페라떼  5000  110

In [4]:
df.tail(3)

      메뉴    가격  칼로리
4  에스프레소  4000   20
5    밀크티  5900  210
6     녹차  5300    0

In [5]:
df.sample(3)

      메뉴    가격  칼로리
6     녹차  5300    0
5    밀크티  5900  210
4  에스프레소  4000   20

### 2. 데이터프레임의 크기

In [7]:
df.shape

(7, 3)

### 3. 컬럼별 자료형

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   메뉴      7 non-null      object
 1   가격      7 non-null      int64
 2   칼로리     7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

### 4. 상관 관계

In [9]:
df.corr(numeric_only=True)

           가격       칼로리
가격   1.000000  0.713227
칼로리  0.713227  1.000000

### 5. 범주형 데이터 탐색

In [11]:
df_car = pd.DataFrame({
    "car":['Sedan', 'SUV', 'Sedan', 'SUV', 'SUV', 'SUV', 'Sedan','Sedan','Sedan','Sedan','Sedan',],
    "size": ['S', 'M','S','S','M','M','L','S','S','M','S',]
})
df_car.head(3)

     car size
0  Sedan    S
1    SUV    M
2  Sedan    S

### 고유한 값의 개수

In [22]:
# 컬럼별 고유한 값의 개수
df_car.nunique()

car     2
size    3
dtype: int64

In [23]:
# 고유한 값
print(df_car['car'].unique())
print(df_car['size'].unique())

['Sedan' 'SUV']
['S' 'M' 'L']

In [25]:
# 항목별 개수
print(df_car['car'].value_counts())
print(df_car['size'].value_counts())

car
Sedan    7
SUV      4
Name: count, dtype: int64
size
S    6
M    4
L    1
Name: count, dtype: int64

In [27]:
# 기술통계 (수치형)
df.describe()

                가격         칼로리
count     7.000000    7.000000
mean   5028.571429  101.428571
std     631.702160   99.402980
min    4000.000000    0.000000
25%    4750.000000   15.000000
50%    5000.000000  110.000000
75%    5400.000000  160.000000
max    5900.000000  250.000000

In [31]:
# 기술통계(object 자료형)
df_car.describe(include="O")

          car size
count      11   11
unique      2    3
top     Sedan    S
freq        7    6

In [32]:
df.describe(include="O")

           메뉴
count       7
unique      7
top     아메리카노
freq        1